any where winlog.channel:"System" and ((winlog.provider_name:"Service Control Manager" and event.code:"7045") and ((winlog.event_data.ImagePath:"*ADMIN$*" and winlog.event_data.ImagePath:"*.exe*") or (winlog.event_data.ImagePath:"*%COMSPEC%*" and winlog.event_data.ImagePath:"*start*" and winlog.event_data.ImagePath:"*powershell*") or winlog.event_data.ImagePath:"*powershell -nop -w hidden -encodedcommand*" or winlog.event_data.ImagePath like~ ("*SUVYIChOZXctT2JqZWN0IE5ldC5XZWJjbGllbnQpLkRvd25sb2FkU3RyaW5nKCdodHRwOi8vMTI3LjAuMC4xO*", "*lFWCAoTmV3LU9iamVjdCBOZXQuV2ViY2xpZW50KS5Eb3dubG9hZFN0cmluZygnaHR0cDovLzEyNy4wLjAuMT*", "*JRVggKE5ldy1PYmplY3QgTmV0LldlYmNsaWVudCkuRG93bmxvYWRTdHJpbmcoJ2h0dHA6Ly8xMjcuMC4wLjE6*")))
