any where winlog.channel:"Security" and ((event.code:"5156" and destination.port:88) and (not ((process.executable like~ ("\\device\\harddiskvolume*", "C:*")) and process.executable:"*\\Windows\\System32\\lsass.exe")) and (not (((process.executable like~ ("\\device\\harddiskvolume*", "C:*")) and (process.executable like~ ("*\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe", "*\\Program Files\\Google\\Chrome\\Application\\chrome.exe"))) or ((process.executable like~ ("\\device\\harddiskvolume*", "C:*")) and (process.executable like~ ("*\\Program Files (x86)\\Mozilla Firefox\\firefox.exe", "*\\Program Files\\Mozilla Firefox\\firefox.exe"))) or process.executable:"*\\tomcat\\bin\\tomcat8.exe")))
