any where winlog.channel:"System" and ((winlog.provider_name:"Service Control Manager" and event.code:"7023") and ((winlog.event_data.param1 like~ ("* Antivirus*", "* Firewall*", "*Application Guard*", "*BitLocker Drive Encryption Service*", "*Encrypting File System*", "*Microsoft Defender*", "*Threat Protection*", "*Windows Event Log*")) or (winlog.event_data.Binary like~ ("*770069006e0064006500660065006e006400*", "*4500760065006e0074004c006f006700*", "*6d0070007300730076006300*", "*530065006e0073006500*", "*450046005300*", "*420044004500530056004300*"))))
