any where winlog.channel:"Security" and ((event.code:"4657" and winlog.event_data.ObjectName:"*\\SOFTWARE\\Microsoft\\.NETFramework" and winlog.event_data.ObjectValueName:"ETWEnabled" and winlog.event_data.NewValue:"0") or (event.code:"4657" and winlog.event_data.ObjectName:"*\\Environment*" and (winlog.event_data.ObjectValueName like~ ("COMPlus_ETWEnabled", "COMPlus_ETWFlags")) and winlog.event_data.NewValue:"0"))
