any where winlog.channel:"Security" and (event.code:"4697" and (((winlog.event_data.ServiceFileName:"*/c*" and winlog.event_data.ServiceFileName:"*echo*" and winlog.event_data.ServiceFileName:"*\\pipe\*") and (winlog.event_data.ServiceFileName like~ ("*cmd*", "*%COMSPEC%*"))) or (winlog.event_data.ServiceFileName:"*rundll32*" and winlog.event_data.ServiceFileName:"*.dll,a*" and winlog.event_data.ServiceFileName:"*/p:*") or winlog.event_data.ServiceFileName:"\\127.0.0.1\\ADMIN$\*"))
