any where winlog.channel:"System" and (winlog.provider_name:"Service Control Manager" and event.code:"7045" and (winlog.event_data.ImagePath:"*new-object*" and winlog.event_data.ImagePath:"*text.encoding]::ascii*" and winlog.event_data.ImagePath:"*readtoend*") and (winlog.event_data.ImagePath like~ ("*:system.io.compression.deflatestream*", "*system.io.streamreader*")))
