any where winlog.channel:"Security" and ((event.code:"5136" and (winlog.event_data.AttributeLDAPDisplayName like~ ("gPCMachineExtensionNames", "gPCUserExtensionNames")) and (winlog.event_data.AttributeValue like~ ("*CAB54552-DEEA-4691-817E-ED4A4D1AFC72*", "*AADCED64-746C-4633-A97C-D61349046527*"))) or (event.code:"5145" and winlog.event_data.ShareName:"*\\SYSVOL" and winlog.event_data.RelativeTargetName:"*ScheduledTasks.xml" and (winlog.event_data.AccessList like~ ("*WriteData*", "*%%4417*"))))
