any where winlog.channel:"Security" and (event.code:"5156" and ((source.port:3389 and (destination.ip like~ ("127.*", "::1"))) or (destination.port:3389 and (source.ip like~ ("127.*", "::1")))) and (not (winlog.event_data.FilterOrigin:"AppContainer Loopback" or (process.executable like~ ("*\\thor.exe", "*\\thor64.exe")))))
