any where winlog.channel:"System" and (winlog.provider_name:"Service Control Manager" and event.code:"7045" and (winlog.event_data.ImagePath:"*cmd*" and winlog.event_data.ImagePath:"*&&*" and winlog.event_data.ImagePath:"*clipboard]::*"))
