any where winlog.channel:"System" and (winlog.provider_name:"Service Control Manager" and event.code:"7045" and (winlog.event_data.ImagePath:"*&&*" and winlog.event_data.ImagePath:"*rundll32*" and winlog.event_data.ImagePath:"*shell32.dll*" and winlog.event_data.ImagePath:"*shellexec_rundll*") and (winlog.event_data.ImagePath like~ ("*value*", "*invoke*", "*comspec*", "*iex*")))
