any where winlog.channel:"System" and ((winlog.provider_name:"Service Control Manager" and event.code:"7045") and (winlog.event_data.ImagePath like~ ("* -c *", "* /c *", "* –c *", "* —c *", "* ―c *") or winlog.event_data.ImagePath like~ ("* -r *", "* /r *", "* –r *", "* —r *", "* ―r *") or winlog.event_data.ImagePath like~ ("* -k *", "* /k *", "* –k *", "* —k *", "* ―k *")) and (winlog.event_data.ImagePath like~ ("*cscript*", "*mshta*", "*powershell*", "*pwsh*", "*regsvr32*", "*rundll32*", "*wscript*")))
