any where winlog.channel:"Security" and (event.code:"4616" and (not (process.executable:"C:\\Windows\\System32\\svchost.exe" and user.id:"S-1-5-19")) and (not (process.executable like~ ("C:\\Program Files\\VMware\\VMware Tools\\vmtoolsd.exe", "C:\\Program Files (x86)\\VMware\\VMware Tools\\vmtoolsd.exe", "C:\\Windows\\System32\\VBoxService.exe", "C:\\Windows\\System32\\oobe\\msoobe.exe"))))
